     *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
        01  SC071.
            03  SC071-ADRS       PIC X(100).
            03  SC071-HOSPNAME   PIC X(100).
            03  SC071-KAISETU    PIC X(80).
            03  SC071-TEL        PIC X(15).
            03  SC071-HOSPCD     PIC X(14).
            03  SC071-SRYYM      PIC X(16).
            03  SC071-SEIYMD     PIC X(22).
            03  SC071-SEIKYUGK   PIC X(10).
            03  SC071-KENSU      PIC X(06).
            03  SC071-MAISU      PIC X(05).
